'''
Задание 1
Реализуйте функцию count_letter, которая принимает список слов и некоторую букву и возвращает количество слов в списке, в которых эта буква встречается хотя бы один раз.

Например, для списка ['python', 'c++', 'c', 'scala', 'java'] и буквы c ваша функция должна вернуть число 3.

Подсказки
Используйте конструкцию for word in ... для итерации по списку.
Используйте переменную для хранения промежуточного результата подсчета.
Используйте конструкцию letter in word для проверки наличия буквы в слове.
'''

# def coont_letter():
#     # ['python', 'c++', 'c', 'scala', 'java']
#     a = 1
#     b = 2
#     c = a + b

# coont_letter()

# print(2 + 3)

# def ddd():
#     print("hello")
#     print("world")

# ddd()
# list = ['python', 'c++', 'c', 'scala', 'java']
# print(list)

# list_numbers = [1, 2, 2, 5, 5, 7, 4, 2, 1]
# print(list_numbers.count(2))

# list.index(x, [start [, end]]) = ['python', 'c++', 'c', 'scala', 'java']
# print(list.index)

apple = ['a','p','p','l','e', 'f']  
index = apple.index('p')
print(index)  
name = input('это конец')